tutorials/cfdemSolverRhoPimpleChem/PolydisperseFluidizedBed/R2_FB/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    side-walls
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0.0 0.25 0.0);
/*        type            interstitialInletVelocity;
        inletVelocity      uniform (0 0.25 0);
        alpha              voidfraction;
        value              $internalField;  */
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
