tutorials/cfdemSolverRhoPimpleChem/PolydisperseFluidizedBed/R2_FB/CFD/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.1.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	object		probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



fields
(
	rho
	p
	T
	Cpv
	N2
	CO2
	CO
	H2
	H2O
	ModSpeciesMassField_N2
	ModSpeciesMassField_CO2
	ModSpeciesMassField_CO
	ModSpeciesMassField_H2
	ModSpeciesMassField_H2O
	X_CO
	X_CO2
	X_H2
	X_N2
	X_H2O
	X_N2
	
);

writeControl   timeStep;
writeInterval  10000;


// Locations to be probed.
probeLocations
(
        (0.03 0.025 0.0)
        (0.03 0.050 0.0)
        (0.03 0.075 0.0)
        (0.03 0.090 0.0)
        (0.03 0.120 0.0)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

